# Jeopardy

In [155]:
import pandas as pd
import numpy as np
import re

In [149]:
df = pd.read_csv('jeopardy.csv')

In [150]:
df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [151]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 216930 entries, 0 to 216929
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Show Number  216930 non-null  int64
 1    Air Date    216930 non-null  object
 2    Round       216930 non-null  object
 3    Category    216930 non-null  object
 4    Value       216930 non-null  object
 5    Question    216930 non-null  object
 6    Answer      216928 non-null  object
dtypes: int64(1), object(6)
memory usage: 11.6+ MB

In [152]:
# Change all the column names for easier manipulation and remove whitespace
df.rename(columns={
    'Show Number': 'show_number',
    ' Air Date': 'air_date',
    ' Round': 'round',
    ' Category': 'category',
    ' Value': 'value',
    ' Question': 'question',
    ' Answer': 'answer'},
    inplace=True
)

In [153]:
df.head()

,show_number,air_date,round,category,value,question,answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [144]:
def filter_dataframe(dataframe, words):
    """Filters the dataset 'dataframe' and returns questions that only
    contail *all* of the words in the list 'words'.
    
    Parameters
    ----------
    dataframe: DataFrame
        The dataset with all the questions to be filtered
    words: list
        The list of words used to filter the dataset
        
    Returns
    -------
    DataFrame
        a new data frame with only the rows whose questions include *all* the words
    """
    # Using all() will return True if all of the words in the list words appear
    # in the question text
    filter_expression = lambda x: all(word.lower() in x.lower() for word in words)
    return dataframe[ dataframe['question'].apply(filter_expression) ]

In [145]:
filt = filter_dataframe(df, ['King', 'France'])
filt

,show_number,air_date,round,category,value,question,answer
17413,4496,2004-03-08,Double Jeopardy!,DYNASTY,$1200,The king of France in 1604 & the king of Spain...,the Bourbons
17718,5770,2009-10-16,Double Jeopardy!,MOVIE DEBUTS,$1600,Timothy Dalton was 22 when Peter O'Toole helpe...,The Lion in Winter
23825,4862,2005-11-01,Jeopardy!,"DR. PHIL, SHAKESPEAREAN COUNSELOR",$800,"Regan & Goneril got your inheritance, but you ...",Cordelia
28265,3737,2000-11-28,Double Jeopardy!,THE MIDDLE AGES,$800,"In a 1346 battle, France's Philip VI was Crecy...",Edward III
28576,4752,2005-04-12,Double Jeopardy!,KING ME,"$3,000",He's the last king of France whose reign strad...,Louis XIV
...,...,...,...,...,...,...,...
192169,3583,2000-03-15,Jeopardy!,"YOU SHOULD ""C""",$200,Name shared by the mother of 3 kings of France...,Catherine
193098,5647,2009-03-10,Double Jeopardy!,"HE SAID, SHE SAID",$2000,"<a href=""http://www.j-archive.com/media/2009-0...",Julia Child
203970,5371,2008-01-07,Jeopardy!,IT HAPPENED IN '08,$200,1808: Napoleon's brother Joseph is made king o...,Spain
205541,6061,2011-01-10,Jeopardy!,LAUNDRY DETERGENT,$1000,"Philip III, king of France 1270-1285, was nick...",Bold
212430,3376,1999-04-19,Double Jeopardy!,CHARLES IN CHARGE,"$1,500",This woman was instrumental in putting the Dau...,Joan of Arc

In [154]:
df['value'] = df['value'].replace(['\$'])

show_number     int64
air_date       object
round          object
category       object
value          object
question       object
answer         object
dtype: object

In [169]:
s = '$1,  600'

get_rid_of = re.sub(r'[\$,\s*]', '', s)

In [174]:
get_rid = lambda s: float(re.sub(r'[\$,\s*]', '', s))

In [175]:
f = '$3,000'
x = get_rid(f)

In [176]:
x

3000.0